{
  "date": "2025-08-25T13:31:12.621Z",
  "count": 27,
  "news": [
    {
      "id": "aHR0cHM6Ly93",
      "title": "Supreme Court Collegium recommends appointment of 2 High Court Chief Justices as Judges of the Supreme Court",
      "summary": "At present, the working strength of the Supreme Court is at 32 Judges, if the recommendations are confirmed, then the Court will function at its full strength of 34 Judges. The post Supreme Court Collegium recommends appointment of 2 High Court Chief Justices as Judges of the Supreme Court appear...",
      "url": "https://www.scconline.com/blog/post/2025/08/25/supreme-collegium-recommends-appointment-2-new-sc-judges/",
      "source": "SCC Blog",
      "publishedDate": "2025-08-25T13:15:48.000Z",
      "category": "Analysis",
      "author": "Sucheta"
    },
    {
      "id": "aHR0cHM6Ly93",
      "title": "Faculty of Law, University of Delhi | 1st Arun Jaitley National ADR Competition, 2025",
      "summary": "The 1st Arun Jaitley National Alternative Dispute Resolution (ADR) Competition, 2025 is an esteemed event organized by the Centre for Alternative Dispute Resolution, 5-Year Integrated Law Course (ILC), at the Faculty of Law, University of Delhi. This competition is a significant initiative aimed ...",
      "url": "https://www.scconline.com/blog/post/2025/08/25/faculty-of-law-university-of-delhi-1st-arun-jaitley-national-adr-competition-2025/",
      "source": "SCC Blog",
      "publishedDate": "2025-08-25T13:00:48.000Z",
      "category": "Analysis",
      "author": "Editor"
    },
    {
      "id": "aHR0cHM6Ly93",
      "title": "Posting ‘Pakistan Zindabad’ on social media without denouncing India, not sedition: Himachal Pradesh High Court",
      "summary": "“Hailing a country without denouncing the motherland does not constitute an offence of sedition because it does not incite armed rebellion, subversive activities, or encourage feelings of separatist activities.” The post Posting ‘Pakistan Zindabad’ on social media without denouncing India, not se...",
      "url": "https://www.scconline.com/blog/post/2025/08/25/merely-posting-pakistan-zindabad-not-sedition-hp-hc/",
      "source": "SCC Blog",
      "publishedDate": "2025-08-25T12:30:36.000Z",
      "category": "Analysis",
      "author": "Editor"
    },
    {
      "id": "aHR0cHM6Ly93",
      "title": "Balancing Fairness and Efficiency: Contours of Writ Jurisdiction in the Arbitration Landscape",
      "summary": "by Arush Khanna* and Akarsh Pandey** The post Balancing Fairness and Efficiency: Contours of Writ Jurisdiction in the Arbitration Landscape appeared first on SCC Times.",
      "url": "https://www.scconline.com/blog/post/2025/08/25/contours-writ-jurisdiction-in-arbitration-landscape/",
      "source": "SCC Blog",
      "publishedDate": "2025-08-25T12:00:47.000Z",
      "category": "Analysis",
      "author": "Editor"
    },
    {
      "id": "aHR0cHM6Ly93",
      "title": "‘Attending meetings of organisation not banned under UAPA isn’t prima facie offence’; SC affirms Karnataka HC’s order granting bail",
      "summary": "Karnataka High Court had granted bail to one accused after finding that he was associated with organisations not banned under UAPA; however, the 2nd accused person’s bail was rejected as he was involved with banned terror outfits. The post ‘Attending meetings of organisation not banned under UAPA...",
      "url": "https://www.scconline.com/blog/post/2025/08/25/supreme-court-meetings-of-organisations-not-banned-under-uapa/",
      "source": "SCC Blog",
      "publishedDate": "2025-08-25T11:30:26.000Z",
      "category": "Analysis",
      "author": "Sucheta"
    },
    {
      "id": "aHR0cHM6Ly93",
      "title": "POCSO cases to be tried expeditiously; applications to recall witnesses without disclosing justifiable reason not permitted: Delhi High Court",
      "summary": "In the present case, it is merely stated that certain clarification is required, for which cross-examination of the witnesses is sought. Such vague assertion, without specifying the nature of the discrepancies or their relevance to the just adjudication of the case, cannot constitute a sound grou...",
      "url": "https://www.scconline.com/blog/post/2025/08/25/delhi-hc-denies-ruling-on-recalling-witnesses-in-pocso-cases/",
      "source": "SCC Blog",
      "publishedDate": "2025-08-25T11:00:42.000Z",
      "category": "Analysis",
      "author": "Editor"
    },
    {
      "id": "aHR0cHM6Ly93",
      "title": "‘Equating disability with inefficiency is terribly apathetic’; P&H HC orders Department to grant pensionary benefits accrued to deceased husband",
      "summary": "An arbitrary review of a predecessor’s order is impermissible in law if the same is not void or contrary to the statutory provisions. The post ‘Equating disability with inefficiency is terribly apathetic’; P&H HC orders Department to grant pensionary benefits accrued to deceased husband appeared ...",
      "url": "https://www.scconline.com/blog/post/2025/08/25/ph-hc-equating-disability-with-inefficiency-is-terribly-apathetic/",
      "source": "SCC Blog",
      "publishedDate": "2025-08-25T10:30:46.000Z",
      "category": "Analysis",
      "author": "Editor"
    },
    {
      "id": "aHR0cHM6Ly93",
      "title": "Removal of Panchayat Administrators without giving them an opportunity of being heard is arbitrary: Rajasthan High Court",
      "summary": "“In the name and interest of delimitation, the Government cannot postpone the entire election process of the Panchayati Raj Institutions indefinitely, contrary to the mandate contained under Article 243-E of the Constitution.” The post Removal of Panchayat Administrators without giving them an op...",
      "url": "https://www.scconline.com/blog/post/2025/08/25/rajasthan-high-court-removal-panchayat-administrators-without-opportunity-of-hearing/",
      "source": "SCC Blog",
      "publishedDate": "2025-08-25T10:00:46.000Z",
      "category": "Analysis",
      "author": "Editor"
    },
    {
      "id": "aHR0cHM6Ly93",
      "title": "Karnataka High Court upholds compulsory retirement of Senior Civil Judge for threatening police officer with dire consequences",
      "summary": "The Senior Civil Judge had allegedly threatened a police officer over a phone call in a complaint case filed against his sister. The post Karnataka High Court upholds compulsory retirement of Senior Civil Judge for threatening police officer with dire consequences appeared first on SCC Times.",
      "url": "https://www.scconline.com/blog/post/2025/08/25/karnataka-high-court-upholds-compulsory-retirement-of-senior-civil-judge/",
      "source": "SCC Blog",
      "publishedDate": "2025-08-25T09:30:34.000Z",
      "category": "Analysis",
      "author": "Editor"
    },
    {
      "id": "aHR0cHM6Ly93",
      "title": "Supreme Court remands BJP MLA Tankadhar Tripathy’s election case to Orissa HC; Directs scrutiny of defects in Form 25 affidavit",
      "summary": "This matter pertains to the degree of ‘substantial compliance’ with the prescribed Form 25 affidavit, as encapsulated in the proviso to Section 83(1)(c) of the Representation of the People Act, 1951 read with Rule 94-A of the Conduct of Elections Rules, 1961. The post Supreme Court remands BJP ML...",
      "url": "https://www.scconline.com/blog/post/2025/08/25/sc-remands-election-case-bjp-mla-tankadhar-tripathy-orissa-hc-scrutiny-form-25-affidavit-defects/",
      "source": "SCC Blog",
      "publishedDate": "2025-08-25T09:00:37.000Z",
      "category": "Analysis",
      "author": "Apoorva"
    },
    {
      "id": "aHR0cHM6Ly9s",
      "title": "Call for Applications: CEDE–LAOT Legal Writing Analysts",
      "summary": "The Law and Other Things Blog (LAOT), in collaboration with the Community for the Eradication of Discrimination in Education and Employment (CEDE), is inviting applications for the position of Legal Writing Analysts from students selected through CEDE’s internal process. About the Blog Founded in...",
      "url": "https://lawandotherthings.com/call-for-applications-cede-laot-legal-writing-analysts/",
      "source": "Law and Other Things",
      "publishedDate": "2025-08-23T13:19:23.000Z",
      "category": "Academic",
      "author": "LAOT"
    },
    {
      "id": "aHR0cHM6Ly9s",
      "title": "Challenging Majoritarianism in Questions of Religious Freedom: A Critique of Ramesh Baghel",
      "summary": "The article critiques the Supreme Court's decision in Ramesh Baghel v. State of Chhattisgarh, arguing that the ruling is arbitrary and inconsistent, exposing its judicial endorsement of majoritarian biases at the expense of minority rights. The author proposes a principled three-pronged test to e...",
      "url": "https://lawandotherthings.com/challenging-majoritarianism-in-questions-of-religious-freedom-a-critique-of-ramesh-baghel/",
      "source": "Law and Other Things",
      "publishedDate": "2025-08-15T10:58:23.000Z",
      "category": "Academic",
      "author": "Namya Nanda"
    },
    {
      "id": "aHR0cHM6Ly9p",
      "title": "Missing the Trees for the Forest: Why Zahad v. State of Kerela Falls Short of Recognizing Trans-parenthood [Guest Post]",
      "summary": "[This is a guest post by Muskan Tibrewala.] In a much-celebrated decision of the High Court of Kerela in Zahad v. State of Kerala, the court directed the Kozhikhode Corporation to issue a modified birth certificate to the child of transgender parents. The modification is for the certificate to re...",
      "url": "https://indconlawphil.wordpress.com/2025/08/13/missing-the-trees-for-the-forest-why-zahad-v-state-of-kerela-falls-short-of-recognizing-trans-parenthood-guest-post/",
      "source": "Indian Constitutional Law",
      "publishedDate": "2025-08-13T10:01:30.000Z",
      "category": "Constitutional",
      "author": "Gautam Bhatia"
    },
    {
      "id": "aHR0cHM6Ly9s",
      "title": "The Truth and Nothing But the Truth? The Constitutional Ghost of J&K’s Truth & Reconciliation Commission",
      "summary": "Justice Sanjay Kishan Kaul’s concurring opinion in the Article 370 judgment proposed the creation of an impartial Truth and Reconciliation Commission for Jammu & Kashmir. Two years hence, no such body has been established. Uncertainty persists over the binding nature of this aspect of the judgmen...",
      "url": "https://lawandotherthings.com/the-truth-and-nothing-but-the-truth-the-constitutional-ghost-of-jks-truth-reconciliation-commission-2/",
      "source": "Law and Other Things",
      "publishedDate": "2025-08-10T06:06:28.000Z",
      "category": "Academic",
      "author": "Gokul K. Sunoj and Adithi Holla"
    },
    {
      "id": "aHR0cHM6Ly9p",
      "title": "The constitutional demand at the heart of voter-fraud allegations",
      "summary": "This week, the Leader of the Opposition made serious allegations of voter fraud in an assembly constituency in Bangalore. This post does not analyse these allegations but rather focuses on the constitutional demands the present moment raises. First, it briefly discusses how the veracity of the al...",
      "url": "https://indconlawphil.wordpress.com/2025/08/09/the-constitutional-demand-at-the-heart-of-voter-fraud-allegations/",
      "source": "Indian Constitutional Law",
      "publishedDate": "2025-08-09T03:18:29.000Z",
      "category": "Constitutional",
      "author": "Vasudev Devadasan"
    },
    {
      "id": "aHR0cHM6Ly9s",
      "title": "What Is In The Interest Of The General Public? Examining The Constitutional Validity Of Meat Ban Orders During Religious Festivals",
      "summary": "This blog examines the constitutional validity of meat ban orders imposed during religious festivals across India, which restrict the fundamental right to freedom of trade under Article 19(1)(g). The blog analyses the literal and purposive interpretation of the phrase \"interests of the general pu...",
      "url": "https://lawandotherthings.com/what-is-in-the-interest-of-the-general-public-examining-the-constitutional-validity-of-meat-ban-orders-during-religious-festivals/",
      "source": "Law and Other Things",
      "publishedDate": "2025-08-08T05:48:17.000Z",
      "category": "Academic",
      "author": "Tanishq Desai"
    },
    {
      "id": "aHR0cHM6Ly9p",
      "title": "Guest Post: In Defence of the Kenyan Supreme Court and Suspended Declarations – A Response to Joshua Malidzo Nyawa",
      "summary": "[This is a guest post by Kenson Mutethia.] Introduction I rarely disagree with Joshua unless it’s a serious matter of principle. Part A of Joshua’s recent blog, “A Constitutional Travesty-II: Unpacking the Kenyan Supreme Court’s Finance Act Judgment,” is one of those rare instances where I fundam...",
      "url": "https://indconlawphil.wordpress.com/2025/08/07/guest-post-in-defence-of-the-kenyan-supreme-court-and-suspended-declarations-a-response-to-joshua-malidzo-nyawa/",
      "source": "Indian Constitutional Law",
      "publishedDate": "2025-08-07T16:45:19.000Z",
      "category": "Constitutional",
      "author": "Gautam Bhatia"
    },
    {
      "id": "aHR0cHM6Ly9p",
      "title": "Guest Post: When Najeeb meets Watali – On the statutory restrictions on grant of bail under UAPA",
      "summary": "[This is a guest post by Hany Babu and Surendra Gadling, who have been detained in prison as “undertrials” since 2020 and 2018, respectively. This piece is being published here simultaneously with The Proof of Guilt blog.] For previous work by the authors on this blog, see “How Long is Too Long? ...",
      "url": "https://indconlawphil.wordpress.com/2025/08/07/guest-post-when-najeeb-meets-watali-on-the-statutory-restrictions-on-grant-of-bail-under-uapa/",
      "source": "Indian Constitutional Law",
      "publishedDate": "2025-08-07T12:33:35.000Z",
      "category": "Constitutional",
      "author": "Gautam Bhatia"
    },
    {
      "id": "aHR0cHM6Ly9p",
      "title": "CLP Turns 12 || Editorial Notes",
      "summary": "I am three days late to this, but on August 2, the Constitutional Law and Philosophy blog marked twelve years of its existence (2013 – 2025). I normally use the opportunity of an anniversary to engage in some critical reflection on what we’ve done on the blog so far, in the broader context of con...",
      "url": "https://indconlawphil.wordpress.com/2025/08/05/clp-turns-12-editorial-notes/",
      "source": "Indian Constitutional Law",
      "publishedDate": "2025-08-05T07:20:36.000Z",
      "category": "Constitutional",
      "author": "Gautam Bhatia"
    },
    {
      "id": "aHR0cHM6Ly9s",
      "title": "Movement Lawyering Against Caste: Violence in Universities, Prisons and Beyond | Adv Disha Wadekar.",
      "summary": "In this episode of the Law and Other Things podcast, host Sannidhi speaks with Advocate Disha Wadekar about the limits of India’s anti-discrimination law in addressing caste-based oppression in higher educational institutions and prisons. Drawing from her extensive work in landmark cases like tho...",
      "url": "https://lawandotherthings.com/movement-lawyering-against-caste-violence-in-universities-prisons-and-beyond-adv-disha-wadekar/",
      "source": "Law and Other Things",
      "publishedDate": "2025-07-30T13:00:11.000Z",
      "category": "Academic",
      "author": "Sai Sujana Sannidhi Perugu"
    },
    {
      "id": "aHR0cHM6Ly9p",
      "title": "A Constitutional Travesty – II: Unpacking the Kenyan Supreme Court’s Finance Act Judgment [Guest Post]",
      "summary": "[This is a guest post by Joshua Malidzo Nyawa.] Introduction In part 1 of this post, I introduced the decision of the Supreme Court of Kenya and responded to Gautam’s post. Part 1 of this post was mainly centred on the aspect of public participation in the decision. However, part 1 laid down a th...",
      "url": "https://indconlawphil.wordpress.com/2025/07/30/a-constitutional-travesty-ii-unpacking-the-kenyan-supreme-courts-finance-act-judgment-guest-post/",
      "source": "Indian Constitutional Law",
      "publishedDate": "2025-07-30T10:35:54.000Z",
      "category": "Constitutional",
      "author": "Gautam Bhatia"
    },
    {
      "id": "aHR0cHM6Ly9p",
      "title": "Guest Post: Keeping Faith with Equality – the Supreme Court of Kenya’s Clarion Call on Muslim Inheritance and Children’s Rights",
      "summary": "[This is a guest post by Miracle Okoth Mudeyi and Ochiel Dudley.] Introduction On 30 June 2025 the Supreme Court of Kenya delivered its decision in Fatuma Athman Abud Faraj v Ruth Faith Mwawasi & 2 Others, SC Petition No E035 of 2023 (the Faraj judgment). The Court faced a deceptively simple ques...",
      "url": "https://indconlawphil.wordpress.com/2025/07/30/guest-post-keeping-faith-with-equality-the-supreme-court-of-kenyas-clarion-call-on-muslim-inheritance-and-childrens-rights/",
      "source": "Indian Constitutional Law",
      "publishedDate": "2025-07-30T08:50:37.000Z",
      "category": "Constitutional",
      "author": "Gautam Bhatia"
    },
    {
      "id": "aHR0cHM6Ly9s",
      "title": "A Shift in the Sands: Federal Balance in the Industrial Alcohol Case Part-II",
      "summary": "The article delves into the innovative approach taken by the Supreme Court in the case of Lalta Prasad Vaish v. State of Uttar Pradesh, focusing on the principle of federal balance used in the same. It seeks to provide argumentations in support of the majority opinion, with the intent of developi...",
      "url": "https://lawandotherthings.com/a-shift-in-the-sands-federal-balance-in-the-industrial-alcohol-case-part-ii/",
      "source": "Law and Other Things",
      "publishedDate": "2025-07-22T07:40:23.000Z",
      "category": "Academic",
      "author": "Jairaj Singh Basur"
    },
    {
      "id": "aHR0cHM6Ly9s",
      "title": "A Shift in the Sands: Federal Balance in the Industrial Alcohol Case Part-I",
      "summary": "The article delves into the innovative approach taken by the Supreme Court in the case of Lalta Prasad Vaish v. State of Uttar Pradesh, focusing on the principle of federal balance used in the same. It seeks to provide argumentations in support of the majority opinion, with the intent of developi...",
      "url": "https://lawandotherthings.com/a-shift-in-the-sands-federal-balance-in-the-industrial-alcohol-case-part-i/",
      "source": "Law and Other Things",
      "publishedDate": "2025-07-22T07:35:33.000Z",
      "category": "Academic",
      "author": "Jairaj Singh Basur"
    },
    {
      "id": "aHR0cHM6Ly9p",
      "title": "Guest Post: The Grammar of the Power to Arrest and Search under UAPA",
      "summary": "[This is a guest post by Hany Babu and Surendra Gadling, who have been detained in prison as “undertrials” since 2020 and 2018, respectively. This piece is being published here simultaneously with The Proof of Guilt blog. For previous work by the authors on this blog, see “How Long is Too Long? –...",
      "url": "https://indconlawphil.wordpress.com/2025/07/19/guest-post-the-grammar-of-the-power-to-arrest-and-search-under-uapa/",
      "source": "Indian Constitutional Law",
      "publishedDate": "2025-07-19T05:04:09.000Z",
      "category": "Constitutional",
      "author": "Gautam Bhatia"
    },
    {
      "id": "aHR0cHM6Ly9p",
      "title": "Where Freedom Ends: On the Supreme Court’s Recent Free Speech Hearings",
      "summary": "On Monday and Tuesday, the Supreme Court heard three cases implicating free speech. One was for a petition for anticipatory bail filed by a cartoonist, Hemant Malviya, whose years-old cartoon strips were dredged up because he recently re-shared them on Twitter. The cartoons were taken to be offen...",
      "url": "https://indconlawphil.wordpress.com/2025/07/16/where-freedom-ends-on-the-supreme-courts-recent-free-speech-hearings/",
      "source": "Indian Constitutional Law",
      "publishedDate": "2025-07-16T14:32:43.000Z",
      "category": "Constitutional",
      "author": "Kieran Correia"
    },
    {
      "id": "aHR0cHM6Ly9p",
      "title": "A Piece of Abstract Art: on the Supreme Court’s Bihar Election Rolls Ruling",
      "summary": "The use of ambiguity is a staple feature in many forms of art. In Romeo and Juliet, Mercutio, after being stabbed, says “ask for me tomorrow, and you shall find me a grave man.” Shakespeare deployed ambiguity to great effect, in order to create “a constant but fluctuating separation between the r...",
      "url": "https://indconlawphil.wordpress.com/2025/07/11/a-piece-of-abstract-art-on-the-supreme-courts-bihar-election-rolls-ruling/",
      "source": "Indian Constitutional Law",
      "publishedDate": "2025-07-11T06:02:37.000Z",
      "category": "Constitutional",
      "author": "Gautam Bhatia"
    }
  ]
}